package Sem1.Task1;

// Реализуйте 3 метода, чтобы в каждом из них получить разные исключения
public class Method2 {
    public static void main(String[] args) {
        int[] a = {1,2,3,4};
        System.out.println(a[5]);
     
    }

}